TestingTwo/app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs" LIMIT $1  [["LIMIT", 1]]

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hola"], ["body", "sdas"], ["created_at", "2024-02-27 18:09:08.843591"], ["updated_at", "2024-02-27 18:09:08.843591"]]

  def destroy
    @blog.destroy!
---
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 4]]

    def set_blog
      @blog = Blog.find(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]