TestingTwo/app/controllers/tables_controller.rb

  def index
    @tables = Table.all
---
SELECT "tables".* FROM "tables"